local function whitespace_flexible_grep(opts, ctx)
  if ctx.filter.search ~= "" then
    ctx = ctx:clone(opts)
    ctx.filter = ctx.filter:clone()
    ctx.filter.search = ctx.filter.search:gsub("%s+", [[\s*]])
  end

  return require("snacks.picker.source.grep").grep(opts, ctx)
end

return {
  "snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        pick = function(cmd, opts)
          return LazyVim.pick(cmd, opts)()
        end,
        header = [[
⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜
⬜⬜⬜⬜⬛⬛🟥🟥🟥🟥🟥⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜
⬜⬜⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜⬜
⬜⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜
⬜⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜
⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜
⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜
⬜⬛🟥🟥🟥🟥🟥🟥🟥🟥⬛⬛🟥🟥🟥⬛⬜⬜⬜⬜⬜
⬜⬛🟥🟥🟥🟥🟥🟥⬛⬛⬜⬛🟥🟥🟥⬛⬜⬜⬜⬜⬜
⬜⬛🟥🟥🟥🟥🟥⬛⬜⬜⬜⬛🟥🟥⬛⬜⬜⬜⬜⬜⬜
⬜⬜⬛🟥🟥🟥⬛⬜⬜⬜⬛🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜
⬜⬜⬛🟥🟥⬛⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜
⬜⬜⬛🟥🟥🟥⬛⬛⬛🟥🟥🟥⬛⬛⬜⬜⬜⬜⬜⬜⬜
⬜⬜⬜⬛🟥🟥🟥🟥🟥🟥🟥⬛🟥⬛⬜⬜⬜⬜⬜⬜⬜
⬜⬜⬜⬜⬛🟥🟥🟥🟥⬛⬛🟥🟥⬛⬛⬜⬜⬜⬜⬜⬜
⬜⬜⬜⬜⬜⬛⬛⬛⬛🟥⬛🟥🟥🟥🟥⬛⬛⬜⬜⬜⬜
⬜⬜⬜⬛⬛⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜⬜
⬜⬜⬛🟥⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛⬜⬜
⬜⬜⬛⬛🟥🟥🟥🟥🟥🟥🟥🟥🟥🟦🟥🟥🟥🟥⬛⬜⬜
⬜⬜⬛⬛⬛🟥⬛🟥⬛⬛🟥🟦🟦🟦🟦🟦🟥🟥🟥⬛⬜
⬜⬛🟥⬛🟥⬛⬛⬛🟥🟥🟥🟦🟦🟦🟦🟦🟦🟥🟥⬛⬜
⬜⬛🟥⬛⬛🟥⬛🟥⬛⬛🟦🟦🟦⬛⬛🟦🟦🟦🟥⬛⬜
⬜⬛🟥⬛🟥⬛⬛⬛🟥🟥🟦🟦⬛⬜⬜⬛🟦🟦🟦🟥⬛
⬜⬛🟥⬛🟥🟥⬛🟥🟥🟦🟦⬛⬜⬜⬜⬛🟦🟦🟦🟥⬛
⬜⬜⬛⬛🟥🟥🟥🟥🟦🟦🟦⬛⬜⬜⬜⬜⬛🟦🟦🟥⬛
⬜⬛🟥⬛🟥🟥🟥🟥🟥🟦🟦⬛⬜⬜⬜⬜⬛🟦🟦🟥⬛
⬜⬛🟥⬛⬛🟥🟥🟥🟥🟦🟦🟦⬛⬜⬜⬜⬛🟦🟦🟥⬛
⬛🟥🟥⬛🟦⬛🟥🟥🟦🟦🟦🟦⬛⬜⬜⬛🟥🟦🟥🟥⬛
⬛🟥⬛⬛🟦🟦⬛⬛🟦🟦🟦🟦🟦⬛⬛🟥🟥🟥🟥🟥⬛
⬛🟥⬛🟦🟦🟦🟦⬛🟦🟦🟦🟦🟦🟦⬛🟥⬛🟥🟥🟥⬛
⬛🟥⬛🟦🟦🟦🟦🟦⬛🟦🟦🟦🟦🟦⬛⬛⬛🟥🟥🟥⬛
 ]],
-- ⬜⬛⬛🟦🟦🟦🟦🟦⬛🟦🟦🟦🟦🟦⬛⬛🟥🟥⬛⬛⬜
-- ⬜⬜⬛🟦🟦🟦🟦🟦⬛🟦🟦🟦🟦🟦🟦⬛⬛⬛⬜⬜⬜
-- ⬜⬜⬜⬛🟦🟦🟦⬛⬜⬛🟦🟦🟦🟦🟦⬛⬜⬜⬜⬜⬜
-- ⬜⬜⬛🟦🟦🟦🟦⬛⬜⬛🟦🟦🟦🟦⬛⬛⬜⬜⬜⬜⬜
-- ⬜⬜⬛⬛⬛⬛⬛⬛⬜⬜⬛⬛⬛⬛🟥🟥⬛⬜⬜⬜⬜
-- ⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬛🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜
-- ⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬜
-- ⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬜
-- ⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜
-- ⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜⬜
-- ⬜⬛🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬛🟥🟥🟥🟥🟥⬛⬜⬜
-- ⬛🟥🟥🟥🟥🟥⬛⬜⬜⬜⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜
-- ⬛⬛⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜⬛🟥🟥🟥🟥⬛⬜⬜
-- ⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛⬛⬛⬜⬜
        -- stylua: ignore
        ---@type snacks.dashboard.Item[]
        keys = {
          -- { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
          -- { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
          -- { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
          -- { icon = " ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
          -- { icon = " ", key = "c", desc = "Config", action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})" },
          { icon = " ", key = "s", desc = "Restore Session", section = "session" },
          -- { icon = " ", key = "x", desc = "Lazy Extras", action = ":LazyExtras" },
          -- { icon = "󰒲 ", key = "l", desc = "Lazy", action = ":Lazy" },
        },
      },
    },
    picker = {
      sources = {
        grep = {
          finder = whitespace_flexible_grep,
          args = {
            "--pcre2",
          },
        },
      },
    },
  },
}
